/*
Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
[345, 897, 568, 234] -> 2
*/

// int GetNum(string message)
// {
//     Console.WriteLine($"Введите {message}: ");
//     int num = int.Parse(Console.ReadLine());
//     return num;
// }

// int[] getRandomArray(int size, int min, int max)
// {
//     int[] array = new int[size];
//     Random rand = new Random();
//     for (int i = 0; i < array.Length; i++)
//     {
//         array[i] = rand.Next(min, max);
//     }
//     return array;
// }

// int SizeArr = GetNum("размер массива");
// int MinArr = GetNum("первый элемент массива");
// int MaxArr = GetNum("последний элемент массива");

// int[] array = getRandomArray(SizeArr, MinArr, MaxArr);

// Console.WriteLine(string.Join(" // ", array));